## Staging: `terragrunt plan -all`
**❌ &nbsp; Terraform Init:** `failed`
**❌ &nbsp; Terraform Validate:** `failed`
**❌ &nbsp; Terraform Format:** `failed`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show Init results</summary>

```sh
15:15:50.629 ERROR  stat ./terragrunt.hcl: no such file or directory
15:15:50.629 ERROR  Unable to determine underlying exit code, so Terragrunt will exit with error code 1

```

</details>

<details>
<summary>Show Validate results</summary>

```sh
15:15:50.680 ERROR  stat ./terragrunt.hcl: no such file or directory
15:15:50.681 ERROR  Unable to determine underlying exit code, so Terragrunt will exit with error code 1

```

</details>

**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cra-arc-upd-tbpc/actions/runs/15141362798).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.cra_upd_ecr will be created
  + resource "aws_ecr_repository" "cra_upd_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "cra-upd-dashboard"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_repository_arn = (known after apply)
  + ecr_repository_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.secrets["AA_CREDS_POOL"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AA_CREDS_POOL"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AIRTABLE_TOKEN"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AIRTABLE_TOKEN"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_CLIENT_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_CLIENT_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_CLIENT_SECRET"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_CLIENT_SECRET"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_COMPANY_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_COMPANY_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_ORGANIZATION_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_ORGANIZATION_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_REPORTSUITE_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_REPORTSUITE_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_TECHNICAL_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_TECHNICAL_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["DOCDB_PASSWORD"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DOCDB_PASSWORD"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["DOCDB_USERNAME"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DOCDB_USERNAME"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["FEEDBACK_API_HOST"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "FEEDBACK_API_HOST"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["FEEDBACK_API_PASSWORD"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "FEEDBACK_API_PASSWORD"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["FEEDBACK_API_USERNAME"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "FEEDBACK_API_USERNAME"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["GSC_EMAIL"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "GSC_EMAIL"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["GSC_KEY"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "GSC_KEY"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["NOTIFY_API_KEY"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "NOTIFY_API_KEY"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["NOTIFY_EMAIL"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "NOTIFY_EMAIL"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["NOTIFY_EMAIL_2"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "NOTIFY_EMAIL_2"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssm_secret_arns = [
      + {
          + name      = "AA_CREDS_POOL"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AIRTABLE_TOKEN"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_CLIENT_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_CLIENT_SECRET"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_COMPANY_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_ORGANIZATION_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_REPORTSUITE_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_TECHNICAL_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "DOCDB_PASSWORD"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "DOCDB_USERNAME"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "FEEDBACK_API_HOST"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "FEEDBACK_API_PASSWORD"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "FEEDBACK_API_USERNAME"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "GSC_EMAIL"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "GSC_KEY"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "NOTIFY_API_KEY"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "NOTIFY_EMAIL"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "NOTIFY_EMAIL_2"
          + valueFrom = (known after apply)
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
module.cra_upd_vpc.data.aws_availability_zones.available: Reading...
module.cra_upd_vpc.data.aws_iam_policy_document.vpc_flow_logs_service_principal[0]: Reading...
module.cra_upd_vpc.data.aws_iam_policy_document.vpc_flow_logs_service_principal[0]: Read complete after 0s [id=2717921857]
module.s3_bucket.aws_s3_bucket_public_access_block.this: Refreshing state... [id=cra-arc-upd-tbpc-codespaces-data]
module.s3_bucket.aws_s3_bucket.this: Refreshing state... [id=cra-arc-upd-tbpc-codespaces-data]
module.cra_upd_vpc.data.aws_availability_zones.available: Read complete after 0s [id=ca-central-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cra_upd_vpc.data.aws_iam_policy_document.vpc_metrics_flow_logs_write[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.cra_upd_vpc.aws_cloudwatch_log_group.flow_logs[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "cra-upd-dashboard_flow_logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # module.cra_upd_vpc.aws_default_network_acl.default will be created
  + resource "aws_default_network_acl" "default" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "CostCentre" = "CraUpdDashboard"
          + "Name"       = "cra-upd-dashboard_default_nacl"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Name"        = "cra-upd-dashboard_default_nacl"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.cra_upd_vpc.aws_default_route_table.default will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = []
      + tags                   = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
          + "name"       = "cra-upd-dashboard_default_route_table"
        }
      + tags_all               = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
          + "name"        = "cra-upd-dashboard_default_route_table"
        }
      + vpc_id                 = (known after apply)
    }

  # module.cra_upd_vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "CraUpdDashboard"
          + "Name"       = "cra-upd-dashboard_default_sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Name"        = "cra-upd-dashboard_default_sg"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.cra_upd_vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "CraUpdDashboard"
          + "Name"       = "cra-upd-dashboard-eip0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Name"        = "cra-upd-dashboard-eip0"
          + "Terraform"   = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.cra_upd_vpc.aws_flow_log.flow_logs[0] will be created
  + resource "aws_flow_log" "flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.cra_upd_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0] will be created
  + resource "aws_iam_policy" "vpc_metrics_flow_logs_write_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for writing flow logs in CloudWatch"
      + id               = (known after apply)
      + name             = "VpcMetricsFlowLogsWrite"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # module.cra_upd_vpc.aws_iam_role.flow_logs[0] will be created
  + resource "aws_iam_role" "flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cra-upd-dashboard_flow_logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cra_upd_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_metrics_flow_logs_write_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cra-upd-dashboard_flow_logs"
    }

  # module.cra_upd_vpc.aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Name"       = "cra-upd-dashboard_internet_gateway"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Name"        = "cra-upd-dashboard_internet_gateway"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.cra_upd_vpc.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "CostCentre" = "CraUpdDashboard"
          + "Name"       = "cra-upd-dashboard-natgw-0"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Name"        = "cra-upd-dashboard-natgw-0"
          + "Terraform"   = "true"
        }
    }

  # module.cra_upd_vpc.aws_network_acl.main will be created
  + resource "aws_network_acl" "main" {
      + arn        = (known after...
```

</details>

